<!DOCTYPE html>
<html>
<head>

<title>A Reply to the Christian Polemic Mary the Mother of Jesus: A Houri in Paradise?: by Rasheed Gonzales</title>
<META NAME="description" CONTENT="It is about Islamic apologetics and refuting Christianity and deviant Muslim sects. It is also about learning Islam. ">
<META NAME="keywords" CONTENT="Bassam Zawadi, Sam Shamoun, Answering Islam, anti Islamic, Refuting Arguments, Jochen Katz, Ali Sina, Quran, Bible, Comparative Religion, ">




<meta name="viewport" content="width=device-width" />
<link rel="stylesheet" type="text/css" href="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/sx.css">

<STYLE TYPE="text/css">

<!--

TD {font-family:Tahoma}

-->
</STYLE>

</head>
<body  topmargin=0 leftmargin=0 marginheight=0 marginwidth=0 >



<script type="text/javascript">
var msets=false;msetm=true;mindex=0;thispage=0;thisparent=0;popm=false;popa=false;
var irootsite="https://o.b5z.net/i/u/6103974//i";var siteurl="/";var ilazy=false;
</script>
<script>
var dii=document.images;function mset(){if(typeof (funcOnPageLoad)!="undefined"){funcOnPageLoad()}mbset();var B=thispage;var C=thisparent;if(dii["i"+B]!=null){dii["i"+B].src=bd+"sel_"+B+".gif?r="+Math.floor(Math.random()*100000)}if(C!=0&&dii["i"+C]!=null){dii["i"+C].src=bd+"sel_"+C+".gif"}if(mindex==0){return }var A=irootsite+"/menu/over_";if(msetm&&msetm==true){for(x=1;x<mi.length;x++){i=mi[x];if(i!=null&&typeof (i)!="undefined"){mi[x]=new Image();mi[x].src=A+i+".gif"}}}if(msets&&msets==true){for(x=1;x<ms.length;x++){i=ms[x];if(i!=null&&typeof (i)!="undefined"){ms[x]=new Image();ms[x].src=A+i+".gif"}}}}function ovp(A,B){if(popa){ovpa(A,B)}pom=true}function ot(A,B){if(popa){ota(A,B)}if(popm){otpop(A);return }if(dii["i"+A]==null){return }if(A!=thispage){dii["i"+A].src=bd+A+".gif"}else{dii["i"+A].src=bd+"sel_"+A+".gif"}}function ov(A,B){if(popa){ovpa(A,B)}if(popm){ovpop(A,B);return }dii["i"+A].src=bd+"over_"+A+".gif"}function ezPOpen(A){ezgu(A,"_self","")}function ezgu(B,A,C){window.open(siteurl+B,A,C)}function loadjs(A,E){var D=document;var C,B=D.getElementsByTagName("script")[0];if(D.getElementById(E)){return }var C=D.createElement("script");C.src=A;C.id=E;B.parentNode.insertBefore(C,B)}function dki(A){return document.getElementById(A)}function mbset(){var A=document;var C=dki("eMB");if(window.innerWidth<=700){if(dki("eMF")==null&&C!=null){mbseti()}else{var B=dki("esbQbarSocial");if(B!=null){var D=dki("esbQbarMob");if(D!=null){D.innerHTML='<div class="ii">'+B.innerHTML+"</div>"}}}}}function mbseti(){var Y=document;var A=dki("eMB");var V=Y.createElement("div");V.innerHTML='<div id="eMF"><a href="'+siteurl+"inc/mob?go=full&link="+location.href+'">view full site</a></div>';Y.body.appendChild(V);try{var C=dki("bantable").getAttribute("data-mobsz");if(C!=null&&C=="f"&&dki("esbtLogoDiv")!=null){var S=new Image();S.src=dki("bantable").getAttribute("background");var R=dki("bantable").offsetWidth;var b=S.width;var J=R/b;var F=S.height*J;dki("esbtLogoDiv").style.height=F+"px"}}catch(d){}var c=false;try{var N="<ul>";var U=dki("mu1");if(U!=null){var T=document.getElementsByClassName("esbmu1");for(var O=0;O<T.length;O++){U=T[O];var f=U.childNodes[0];var B=f.childNodes;for(var M=0;M<f.childNodes.length;M++){var W=B[M].childNodes[0];if(M==0&&B[M].getAttribute("class")=="sel"){c=true}N=N+'<li><a href="'+W.getAttribute("href")+'">'+W.innerHTML+"</a>";try{var Q=dki("mobsys");var L=Q.getAttribute("data-ml");if(L!=null&&L>1){var g=W.getAttribute("id");g=g.replace("cua","");g=g.replace("car","");g=g*1;var H=dki("dm"+g);if(H!=null){var K=H.innerHTML;var X=K.indexOf("<ul>");var G=K.indexOf("</ul>");var Z=K.substring(X+4,G);N=N+'<li class="mmsub"><ul class="mmsub">'+Z+"</ul></li>"}}}catch(d){}}}}else{for(var M=0;M<30;M++){var W=dki("ema"+M);if(W!=null){N=N+'<li><a href="'+W.getAttribute("href")+'">'+W.getAttribute("alt")+"</a>";if(M==0&&W.getAttribute("class")=="sel"){c=true}}}}N=N+"</ul>";var P=dki("esbQbarSocial");var E="";if(P!=null){E='<div class="esbQbarSocial">'+P.innerHTML+"</div>"}dki("eMMi").innerHTML=N+E;var D=A.getAttribute("data-homebtn");if(c==false&&D==3){var a=dki("dm"+thispage);if(a==null){a=dki("dmp"+thispage)}if(a==null&&typeof (esbPopMenus)=="undefined"){a=dki("esbMenTab2")}try{var O=dki("dm"+thispagepar);if(O!=null){a=O}}catch(d){}if(a!=null){c=true;N=a.innerHTML;N=N.replace("<table",'<table width="100%"');N=N.replace('id="mu2"',"")}}if(c==true||D==2){var I=dki("content-main");if(I==null){I=dki("content")}if(I!=null){var V=Y.createElement("div");V.setAttribute("class","eMHL");V.setAttribute("id","eMHL");V.innerHTML=N;if(D==null||D=="0"){V.style.display="none"}I.insertBefore(V,I.childNodes[0])}}else{dki("mobBack").style.display="block"}}catch(d){}}function ezMobResize(){try{var B=j$(window).width();if(B<=700){return true}else{return false}}catch(A){}return false}function esbTogMobm(){if(dki("eMF")==null){mbseti()}var A=dki("eMM");if(A.getAttribute("class")==null){A.setAttribute("class","showit")}else{A.removeAttribute("class")}}function onWinLoad(B){var A=window.onload;if(typeof window.onload!="function"){window.onload=B}else{window.onload=function(){if(A){A()}B()}}}var lzio=null;function fixLazy(A){A.src=A.dataset.src;A.classList.remove("lazy");if(lzio!=null){lzio.unobserve(A)}}function setLazy(){var A=[].slice.call(document.querySelectorAll("img.lazy"));A.forEach(function(B){if(lzio!=null){lzio.observe(B)}else{fixLazy(B)}})}if(ilazy==true){document.addEventListener("DOMContentLoaded",function(){if("IntersectionObserver" in window){lzio=new IntersectionObserver(function(A,B){A.forEach(function(C){if(C.isIntersecting){fixLazy(C.target)}})})}else{}setLazy()})};

</script>


<table cellpadding=0 cellspacing=0 border=0><tr><td><img src="https://o.b5z.net/zirw/h499b3/i/t/w/rnddot.gif" width="1" height="15px"></td></tr></table><center>
<table class="mainall esmTT" width=750 id="pagecontent" cellpadding=0 cellspacing=0 border=0><tr>

<td width="98%" valign=top>
<div class="esbBlankWrap">
<table width="100%" cellpadding=0 cellspacing=0 border=0 style="margin-bottom:1px"><tr>
<td >
<div align=left id="comp1073" class="esbSec" style="margin-bottom:15px">
<div class="esbMod"><div class="esbModtx">
<div class="t2 xtx"><p align="center"><font face="Times New Roman" size="5"><strong><u>A Reply to the Christian Polemic 'Mary the Mother of Jesus: A Houri in Paradise?'</u></strong></font></p>
<p align="center"><font face="Times New Roman" size="3">by </font></p>
<p align="center"><font face="Times New Roman" size="3">Rasheed Gonzales</font></p>
<p align="center">&nbsp;</p>
<p align="justify"><font face="Times New Roman" size="3">The praise is for Allah, and it is sufficed. May peace be upon His slaves who He has chosen. As for what follows .</font></p>
<p align="justify"><font face="Times New Roman" size="3">After painting a sexually explicit picture for his Christian readers with a long introduction in which he describes the <u>H</u>&#363;r&icirc;s of Paradise, their physical features, and other sexually oriented details pertaining to the pleasures of the Hereafter, this Christian polemicist presents his prized piece of evidence for his attack on Prophet Muhammad (may Allah send salutations and peace upon him), <em>Mary the Mother of Jesus: A Houri in Paradise?</em>: a (clipped) quote taken from Ibn Kath&icirc;r's <em>Qasas</em> (not Qisas) <em>al-Anbiy&acirc;'</em> which states,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">&quot;The Messenger of God . said, '<strong>God MARRIED ME IN PARADISE TO MARY THE DAUGHTER OF 'IMRAN</strong> and to the wife of Pharaoh and the sister of Moses.' (Tabarani)&quot; (Ibn Kathir, <em>Qisas al-Anbiya</em> [Cairo: Dar al-Kutub, 1968/1388], p. 381- as cited in Aliah Schleifer's <em>Mary The Blessed Virgin of Islam</em> [Fons Vitae; ISBN: 1887752021; July 1, 1998], p. 64; bold and capital emphasis [the writer's]).</font></p>
</blockquote>
<p align="justify">&nbsp;</p>
<p align="justify"><font face="Times New Roman" size="3">Unfortunately, there have been a couple of ignorant Muslims who have tried to refute this polemic drafted by this Christian writer by referring to the available English translations of <em>Qasas al-Anbiy&acirc;'</em>, which do not include this quote, or any of the similar narrations that Ibn Kath&icirc;r quoted along with it. Had they referred to the Arabic text of the work, or to the work it was originally taken from, <em>al-Bid&acirc;yah wan-Nih&acirc;yah</em>, they would have surely found the quote presented above as well as the necessary information to properly address this polemicist's allegations. So in all fairness, he was not guilty of fabricating some made up <u>h</u>ad&icirc;th or lying (at least in this instance) to support his claims.</font></p>
<p align="justify"><font face="Times New Roman" size="3">One thing he is guilty of, however, is being ignorant-or perhaps not, but is dishonest enough to keep hidden from his readers-of the fact that Ibn Kath&icirc;r quotes a significantly important statement concerning this narration that directly effects the validity of his attack.</font></p>
<p align="justify"><font face="Times New Roman" size="3">The above cited narration from <em>Qasas al-Anbiy&acirc;'</em> is quoted by Ibn Kath&icirc;r under his chapter on the story of Jesus (upon him be peace), under the subheading, &quot;Allah's choosing Mary, peace be upon her&quot;. After mentioning a number of the authentic narrations concerning Mary's high status among the women of Paradise, Ibn Kath&icirc;r states,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">The purpose here is the mention of what is connected to Mary bint 'Imr&acirc;n, peace be upon her. For indeed Allah purified her and chose her over the women of the worlds of her time, and it is conceivable that the favouring of her over the women [of mankind] is general, as we have presented. And it has been mentioned in a <u>h</u>ad&icirc;th that she is from the wives of the Prophet, may Allah send salutations and peace upon him, in Paradise-her and &Acirc;siyah bint Muz&acirc;<u>h</u>im-and in the <em>Tafs&icirc;r</em>&nbsp;we have mentioned from some of the predecessors that he [i.e., Prophet Mu<u>h</u>ammad] said that and drew upon His statement, &laquo;widows and virgins&raquo; (66:5): he said thus the widow is &Acirc;siyah and from the virgins is Mary bint 'Imr&acirc;n; and we mentioned it at the end of the chapter of <em>at-Ta<u>h</u>r&icirc;m</em> [ch. 66]. So Allah is more knowledgeable.</font></p>
<p align="justify"><font face="Times New Roman" size="3">a<u>t</u>-<u>T</u>abar&acirc;n&icirc; said,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">'Abdullah bin N&acirc;jiyyah narrated to us: Mu<u>h</u>ammad bin Sa'd al-'Awf&icirc; narrated to us: Ubay narrated to us: my uncle al-<u>H</u>usain informed us: Y&#363;nus bin Naf&icirc;' narrated to us from Sa'd bin Jun&acirc;dah-he is al-'Awf&icirc;?[who] said, &quot;Allah's messenger, may Allah send&nbsp;salutations and peace upon him, said, &laquo;Surely Allah will marry me to Mary bint 'Imr&acirc;n, the wife of Pharaoh, as well as the sister of Moses in Paradise.&raquo;&quot;</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">It was narrated by Ab&#363; Ja'far al-'Uqail&icirc; from the <u>h</u>ad&icirc;th of 'Abdun-N&#363;r with it, and he ['Abdun-N&#363;r] added, &quot;So I said, '[Be it] a pleasure for you, O Allah's messenger!'&quot; Then al-'Uqail&icirc; said, &quot;<em>It is not preserved</em>.&quot; [Emphasis mine; take note that al-'Uqail&icirc;'s statement, &quot;it is not preserved,&quot; is an indication of the <u>h</u>ad&icirc;th's weakness].</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">Ibn Kath&icirc;r then cites three narrations in which the Prophet, may Allah send salutations and peace upon him, entered upon his dying wife Khad&icirc;jah, may Allah be pleased with her, and mentioned to her that Allah will marry him in Paradise to Mary bint 'Imr&acirc;n, &Acirc;siyah bint Muz&acirc;<u>h</u>im, and Kulthum the sister of Moses. He then comments,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">The basis of the peace from Allah upon Khad&icirc;jah and her glad tidings with house of pearls in Paradise that contains no noise or hardship is in the <u>S</u>a<u>h</u>&icirc;<u>h</u>. However, this context with these additions is very strange. Each of these <u>h</u>ad&icirc;ths, <em>their chains [of transmission] contain a problem</em>. [Emphasis mine].</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">Let us now take a look at what Ibn Kath&icirc;r said in his exegesis of the above mentioned verse (66:5) in his <em>Tafs&icirc;r al-Qur'&acirc;n al-'A<u>dh</u>&icirc;m</em>. Ibn Kath&icirc;r mentions,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">In his <em>al-Mu'jam al-Kab&icirc;r</em>, Abul-Q&acirc;sim a<u>t</u>-<u>T</u>abar&acirc;n&icirc; said,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">Ab&#363; Bakr bin <u>S</u>adaqah narrated to us: Mu<u>h</u>ammad bin Mu<u>h</u>ammad bin Marz&#363;q narrated to us: 'Abdullah bin Umayyah narrated to us: 'Abdul-Qudd&#363;s narrated to us from <u>S</u>&acirc;li<u>h</u> bin <u>H</u>ayy&acirc;n, from Ibn Buraidah, from his father: [concerning] &laquo;widows and virgins&raquo; (66:5), [who] said, &quot;In this verse, Allah promised His prophet, may Allah send salutations and peace upon him, that He would marry him to the widow: &Acirc;siyah, wife of Pharaoh, and with the virgins: Mary bint 'Imr&acirc;n.&quot;</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">In his biography of Mary, peace be upon her, <u>H</u>&acirc;fidh Ibn 'As&acirc;kir mentioned from the route of Suwaid bin Sa'&icirc;d: Mu<u>h</u>ammad bin <u>S</u>&acirc;li<u>h</u> bin 'Umar narrated to us from a<u>d</u>-<u>D</u>a<u>hh</u>&acirc;k and Muj&acirc;hid, from Ibn 'Umar, he said,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">Gabriel came to Allah's messenger, may Allah send salutations and&nbsp;peace upon him, at the death of Khad&icirc;jah and said, &quot;Surely, Allah greets her with peace and gives glad tidings of a house of pearls in Paradise, distant from the fire, containing no hardship, nor noise, of hollow pearls between Mary bint 'Imr&acirc;n's house and &Acirc;siyah bint Muz&acirc;<u>h</u>im's house.&quot;</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">And from the <u>h</u>ad&icirc;th of Ab&icirc; Bakr al-Hudhal&icirc;, from 'Ikrimah, from Ibn 'Abb&acirc;s that the Prophet, may Allah send salutations and&nbsp;peace upon him, entered upon Khad&icirc;jah while she was dying and said, &laquo;O Khad&icirc;jah, if you meet your co-wives, then greet them with peace from me.&raquo; She said, &quot;O Allah's messenger, have you married before me?&quot; He said, &laquo;No, but Allah will marry me to Mary bint 'Imr&acirc;n, &Acirc;siyah wife of Pharaoh, and Kulthum sister of Moses.&raquo; [It is] weak also.</font></p>
<p align="justify"><font face="Times New Roman" size="3">Ab&#363; Ya'l&acirc; said,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">Ibr&acirc;h&icirc;m bin 'Ar'arah narrated to us: 'Abdun-N&#363;r bin 'Abdillah narrated to us: Y&#363;nus bin Shu'aib narrated to us from Ab&icirc; Um&acirc;mah, he said, 'Allah's messenger, may Allah send salutations and&nbsp;peace upon him, said, &laquo;I have learned that Allah married me in Paradise to Mary bint 'Imr&acirc;n, Kulthum sister of Moses, and &Acirc;siyah wife of Pharaoh.&raquo; So I said: [be it] a pleasure for you, O Allah's messenger!'</font></p>
</blockquote></blockquote>
<p align="justify"><font face="Times New Roman" size="3">What is mentioned from Ibn 'As&acirc;kir in this quote is contained in one of the three narrations alluded to previously for which Ibn Kath&icirc;r said, &quot;Each of these <u>h</u>ad&icirc;ths, their chains [of transmission] contain a problem.&quot; The last narration was also quoted earlier and as was mentioned, al-'Uqail&icirc; viewed it as being weak; in <em>Silsilah al-A<u>h</u>&acirc;d&icirc;th a<u>d</u>-<u>D</u>a'&icirc;fah</em> (2/220/no.812), Shaikh al-Alb&acirc;n&icirc; elaborates further mentioning the criticisms of two narrators in its chain: Y&#363;nus bin Shu'aib, who Imam al-Bukh&acirc;r&icirc; declared was rejected in <u>H</u>ad&icirc;th and 'Abdun-N&#363;r bin 'Abdillah bin Sin&acirc;n, who Imam adh-Dhahab&icirc; declared was a liar and accused of fabricating <u>H</u>ad&icirc;th.</font></p>
<p align="justify"><font face="Times New Roman" size="3">With the narrations regarding the marriage of Mary to Prophet Muhammad in Paradise weak, the question is: where did this story originate? Enter Eulogius of Cordova, a Spanish Christian writer and (so-called) martyr who lived during the 800s in Muslim-ruled Andalusia (he was beheaded around 859CE). In his book, <em><a target="_blank" href="http://www.chapters.indigo.ca/books/item/books-978023112333/0231123337/Saracens?ref=Search+Books%3a+'saracens'"><font color="#557799">Saracens: Islam in the Medieval European Imagination</font></a></em> (p. 93), John V. Tolan writes,</font></p>
<blockquote>
<p align="justify"><font face="Times New Roman" size="3">Eulogius deforms Muhammad's biography to fit the standard biographies of Antichrist. He is certainly not ignorant of what Muslims say about their prophet; he simply chooses to present the elements of Muhammad's life that fit the images of Antichrist. One of the favorite topics of Christian polemicists is sex: Muhammad's wives, Muslim polygamy, and the celestial houris promised to the faithful [sounds quite a bit like this writer, no?]. All this is foreign to the ideal of Christian celibacy and to Christian ideas of heaven, but it fits well with the doctrines traditionally attributed to Antichrist. Eulogius has more trouble explaining the Koran's affirmation of the virginity of Jesus' mother. Here, again, his solution is a gross deformation: &quot;I will not repeat the sacrilege which that impure dog [Muhammad] dared proffer about the Blessed Virgin, Queen of the World, holy mother of our venerable Lord and Savior. He claimed . that in the next world he would deflower her.&quot; [Eulogius, <em>Memoriale sanctorum</em>, 1:7 in <em>Corpus Scriptorum Muzarabicorum</em>. 376] This outrageous claim, it seems, is Eulogius's invention; I know of no other Chrisitan polemicist who makes this accusation against Muhammad. Eulogius fabricates lies designed to shock his Christian reader. This way, even those elements of Islam that resemble Christianity (such as reverence of Jesus and his virgin mother) are deformed and blackened, so as to prevent the Christian from admiring anything about the Muslim other.</font></p>
<p align="justify"><font face="Times New Roman" size="3">The goal is to inspire hatred for the &quot;oppressors,&quot; and (as wartime propagandists have long known) there is little better way to do so than to accuse the enemy of murder and rape. If most Cordovans seem ready to tolerate Islam with a sort of ecumenical open-mindedness, Eulogius sets out to show that the Muslim is not a friend but a potential rapist of Christ's virgins.</font></p>
</blockquote>
<p align="justify"><font face="Times New Roman" size="3">Here we have a more than likely origin for such a story. As it is known that some of the early narrators of <u>H</u>ad&icirc;th would also narrate Israelite traditions (Isr&acirc;'&icirc;liyy&acirc;t; narrations originating from the People of the Book), as well as the fact at least one of the narrators of this <u>h</u>ad&icirc;th was accused of fabricating <u>h</u>ad&icirc;ths, it is not entirely strange that this story could have (and probably did) originate from Eulogius (or other Christian polemicists in Andalusia during the third century of Islam). Add the fact that those who recorded the <u>h</u>ad&icirc;th (al-'Uqail&icirc;, at-Tabar&acirc;n&icirc;, Ab&#363; Ya'l&acirc;, and Ibn 'As&acirc;kir) were either young children or not even born yet by the time Eulogius was beheaded and the likelihood only increases.</font></p>
<p align="justify"><font face="Times New Roman" size="3">This book by John Tolan is quite the read; it shows the lengths to which Christian polemicists and anti-Muslim writers of the past went in twisting facts, distorting truths, providing misinformation, or simply fabricating blatant lies in order to defend their religion and attack Islam; lengths we see the Christian polemicists and anti-Muslim writers of today (like this writer and his cronies) going to as well. What Tolan mentions above perfectly illustrates the high probability that many of the weak narrations found in early Islamic texts concerning the Biblical Prophets and other Biblical notables-which many Christian missionaries and polemicists use to attack Islam-were concocted and fabricated by Christians themselves.</font></p>
<p align="justify"><font face="Times New Roman" size="3">And the last of our claim is that the praise is for Allah, Lord of the worlds; and may Allah send His salutations, prayers, and blessings upon our beloved Prophet Mu<u>h</u>ammad, upon his family, his companions, and those who follow them upon charitable conduct until the establishment of the Final Hour.</font></p>
<p align="justify">&nbsp;</p>
<p class="MsoNormal">&nbsp;</p>
<p class="MsoNormal"><font face="Times New Roman"><span style="COLOR: black"><font size="3">Return to </font><a class="lnkm" href="http://www.call-to-monotheism.com/refuting_miscellaneous_arguments"><font color="#3333ff" size="3">Refuting Miscellaneous Arguments</font></a></span></font></p>
<p class="MsoNormal"><font face="Times New Roman" size="3"><span style="COLOR: black">Return to <a target="_self" href="http://www.call-to-monotheism.com/"><font color="#3333ff">Homepage</font></a></span></font></p></div>



</div>
</div>

</div>

</td></tr></TABLE>
<table width="100%" cellpadding=0 cellspacing=0 border=0><tr>
<td valign=top width=50%>
<div style="margin-right:6px;height:100%"></div>
</td>
<td valign=top  width=50%>
<div style="margin-left:6px;height:100%"></div>
</td></tr></TABLE>
<table width="100%" cellpadding=0 cellspacing=0 border=0 style="margin-top:1px;margin-bottom:5px;">
<tr><td >

</td></tr></table>
</div>
</td></tr></table>
<div align="center"><table><tr><td><a href="/home">click here to view site</a></td></tr></table></div>
<p>

<div id="powered" class="footdk" style="display:none"><font size=1>Site Powered By<br>&nbsp;&nbsp;&nbsp;&nbsp;<a href="http://www.webkeeper.co.uk/main/home"><b>WebKeeper WebSite Builder</b></a><br>&nbsp;&nbsp;&nbsp;&nbsp;Online web site design</font><br></div>

<div style="display:none"><div id="esbtMenu0i"></div><div id="esbtMenu0"><script type="text/javascript">
var bd='https://o.b5z.net/zirw/28/i/u/6103974/i/menu/';
thispage=1072;
</script>
<table id="esbMenTab1"border=0 cellpadding=0 cellspacing=0><tr><td valign=middle><a href="/home" id="ema0" onMouseOut="ot()" onMouseOver="ovp(18);" title="" alt="Home"><img src="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/18.gif"  title="" alt="Home" border="0"></a></td><td valign=middle><a href="/what_s_new_" id="ema1" onMouseOut="ot()" onMouseOver="ovp(23);" title="" alt="What's new?"><img src="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/23.gif"  title="" alt="What's new?" border="0"></a></td><td valign=middle><a href="/christianity" id="ema2" onMouseOut="ot()" onMouseOver="ovp(70);" title="" alt="Christianity"><img src="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/70.gif"  title="" alt="Christianity" border="0"></a></td><td valign=middle><a href="/refutations_" id="ema3" onMouseOut="ot()" onMouseOver="ovp(31);" title="" alt="Refutations "><img src="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/31.gif"  title="" alt="Refutations " border="0"></a></td><td valign=middle><a href="/contact_me" id="ema4" onMouseOut="ot()" onMouseOver="ovp(51);" title="" alt="Contact Me"><img src="https://o.b5z.net/zirw/28/i/u/6103974/i/menu/51.gif"  title="" alt="Contact Me" border="0"></a></td></tr></table><script type="text/javascript">
msetm=true;
var mi=[0];
</script></div>
<script type="text/javascript">
window.setTimeout("mbset()",200);
</script>
</div>
</body>
</html>
